* TODO COMMENT Morning Routine [100%] [9/9]
:PROPERTIES:
DEADLINE: <2023-11-21 Tue>
:END:
- [X] Prayer/Lectionary/Lives of the Saints
- [X] Hygiene
- [X] Made bed
- [X] Mobility/Strength
  + /What did you do?/ 
    Ab/hip circuit
- [X] *Morning reflection*
  + /What are your thoughts?/
    Life is going well, but I want today to be productive as well as
    helpful to others, as I prayed for this morning.
- [X] *Morning intention*
  + /Overall focus of today?/
    To eat normally and recoup from yesterday's fast.
    Also to work on all projects/essays/homework and
    not worry too much about ciss240 notes
- [X] *Morning creativity*
  + /Feeling creative or smart?/
    Fr. Spyridon Bailey has amazing quotes on fighting lust,
    but I think these quotes can apply to all passions,
    I will try to type his quote from memory now.

    #+begin_src text
      "God permits us to be challenged by lust, so that we may be victors in this struggle,
      so that we may be crowned when we overcome the passion. We must not allow the
      awareness of our temptations to upset us or rob us of our peace. We must see these
      temptations as an opportunity to struggle for God, and to conquer the passions through
      God's help" -Fr. Spyridon Bailey
    #+end_src
    
    - hide
     #+begin_src elisp
      (org-babel-do-load-languages
       'org-babel-load-languages
       '((emacs-lisp . t)
         (python . t)))
    #+end_src
     #+begin_src python :results output
      def square(x):
          return x * x

      def main():
          x = 4 / 7
          print(f'{x:.5f} and {square(x):.7f}')

      main()
    #+end_src
     #+RESULTS:
    : 0.57143 and 0.3265306

- [X] Start planning today and use agenda to help
- [X] git push before leaving 
  make sure you take everything you need for the day
* TODO [#A] Today's goals [30%] [3/10]
:PROPERTIES:
DEADLINE: <2023-11-21 Tue>
:END:
- [ ] Prayer rope/book
- [ ] Read/Note 10 pages or Read 20 pages of book
  - Input book(s) and all info here:
- [ ] call a friend/family member
- [X] Duolingo
- [X] Practice touch typing
- [X] create TODOs for agenda
- [ ] paper 3 foundations
  writing all of it in an org-file before putting it into word
- [ ] pygame midterm test
- [ ] pygame
- [ ] Safeguard for the Soul
  
* TODO Evening Routine [0%] [0/8]
:PROPERTIES:
DEADLINE: <2023-11-21 Tue>
:END:
- [ ] Make sure all daily goals are met 
- [ ] Mobility/Isometrics
  + /What did you do?/
- [ ] *Evening reflection*
  + /How's it all going?/
- [ ] *Evening thanks*
  + /How've you been blessed today?/
- [ ] *Evening creativity*
  + /What do you want to express?/
- [ ] Hygiene
- [ ] Prayer
- [ ] 7:30+ hours of sleep
